---
kind: other
id: Methods.T:Autodesk.Revit.DB.PrintParameters
source: html/ce25ec7c-87c9-93d2-8856-a22daec15bad.htm
---
# PrintParameters Methods

Causes the object to release immediately any resources it may be utilizing.